Revit 2027 API
BaseArray.NumMembers Property
Retrieves or changes the number of the arrayed members.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract int NumMembers { get; set; }
Public MustOverride Property NumMembers As Integer
	Get
	Set
public:
virtual property int NumMembers {
	int get () abstract;
	void set (int value) abstract;
}
abstract NumMembers : int with get, set
Property Value
Int32
Remarks
In projects, the minimum value is 2 for linear arrays and 3 for radial arrays. In families, the minimum value is 0 for all arrays. The maximum value is 200.
See Also
Reference
BaseArray Class
Autodesk.Revit.DB Namespace